sensoroptconverged/con/6.0_deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    down
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       216944;
    }
    right
    {
        type            patch;
        nFaces          200;
        startFace       217344;
    }
    up
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       217544;
    }
    left
    {
        type            patch;
        nFaces          200;
        startFace       217944;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          108623;
        startFace       218144;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          108623;
        startFace       326767;
    }
    wing
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          436;
        startFace       435390;
    }
)

// ************************************************************************* //
